// ================================================================
// 3. Блоки и IIFE. Приватность.
// ================================================================

// ES5 - Облоасть видимости IIFE
// (function(){
//     var userName = "Джон До";
//     console.log(userName); // переменная видна внутри
// })();
// console.log(userName); // и не вилна снаружи

// ES6 - Блочная область видимости {}
// {
//     const userName = "Джон До";
//     console.log(userName);  // переменная видна внутри
// }
// console.log(userName);  // и не видна снаружи

/*
ВЫВОДЫ:
1) Если вам нужна приватность для let и const, то можно использовать block scope
*/